app/views/presentations/_presentation.html.erb

<tr>
  <td><%= presentation.group.name %></td>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]