app/views/presentations/index.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <tr>
          <td><%= presentation.group.name %></td>

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
          <tr>
            <td><%= presentation.group.name %></td>