app/views/presentations/show.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<p class="show-field">
  <strong>Group:</strong> <%= @presentation.group.name %>