app/views/presentations/show.html.erb

<p>
    <% if @presentation.feedbacks.any? %>
      <strong>Feedback (<%= @presentation.feedbacks.count %>):</strong>
---
SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."presentation_id" = ?  [["presentation_id", 2]]
SELECT 1 AS one FROM "feedbacks" WHERE "feedbacks"."presentation_id" = ? LIMIT ?  [["presentation_id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "feedbacks" WHERE "feedbacks"."presentation_id" = ?  [["presentation_id", 2]]