app/views/groups/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."group_id" = ?  [["group_id", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."group_id" = ? LIMIT ?  [["group_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "users" WHERE "users"."group_id" = ?  [["group_id", 1]]
---
<p>
    <% if @group.users.any? %>
      <strong>Users (<%= @group.users.count %>):</strong>