app/views/users/_form.html.erb

      <%= form.label :Group, class: "form-label"  %>
    <%= form.collection_select :group_id, Group.all, :id, :name, { :include_blank => "No Group" } %>
---
SELECT "groups".* FROM "groups"