app/views/users/_teacheredit.html.erb

    <%= form.label :Group %>
    <%= form.collection_select :group_id, Group.all, :id, :name, { :include_blank => "No Group" } %>
---
SELECT "groups".* FROM "groups"