app/views/users/index.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <% if (user.group_id != nil) %>
          <td><%= user.group.name %></td>