app/views/users/show.html.erb

  <% if @user.group_id != nil %>
    <%= @user.group.name %>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

<% if @user.group_id != nil %>
  <% if @user.group.presentations.any?%>
---
SELECT "presentations".* FROM "presentations"
SELECT 1 AS one FROM "presentations" WHERE "presentations"."group_id" = ? LIMIT ?  [["group_id", 1], ["LIMIT", 1]]