app/views/feedbacks/_form.html.erb

SELECT "presentations".* FROM "presentations" WHERE "presentations"."group_id" != ?  [["group_id", 1]]
---
    <%= form.label :presentation, class: "form-label" %>
    <%= form.collection_select :presentation_id, Presentation.where.not(group_id: current_user.group_id), :id, :topic, class: "form-control" %>