app/controllers/feedbacks_controller.rb

SELECT "feedbacks".* FROM "feedbacks"
---
  def index
    @feedbacks = Feedback.all

INSERT INTO "feedbacks" ("presentation_id", "ranking", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["presentation_id", 2], ["ranking", 10], ["comment", "Testing the range of the ranking"], ["created_at", "2020-12-04 23:39:19.965853"], ["updated_at", "2020-12-04 23:39:19.965853"]]
---
  def create
    @feedback = Feedback.new(feedback_params)

    respond_to do |format|
      if @feedback.save

DELETE FROM "feedbacks" WHERE "feedbacks"."id" = ?  [["id", 4]]
---
  def destroy
    @feedback.destroy

SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_feedback
      @feedback = Feedback.find(params[:id])