app/controllers/groups_controller.rb

INSERT INTO "groups" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Doritos"], ["created_at", "2020-12-05 22:09:57.338562"], ["updated_at", "2020-12-05 22:09:57.338562"]]
---
  def create
    @group = Group.new(group_params)

    respond_to do |format|
      if @group.save

SELECT "users".* FROM "users" WHERE "users"."group_id" = ?  [["group_id", 3]]
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 3]]
---
  def destroy
    @group.users.each do |user|
      user.group_id = nil
      user.save!
    end
    @group.destroy