app/controllers/presentations_controller.rb

  def index
    @presentations = Presentation.all
---
SELECT "presentations".* FROM "presentations"

  def create
    @presentation = Presentation.new(presentation_params)

    respond_to do |format|
      if @presentation.save
---
INSERT INTO "presentations" ("group_id", "topic", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["group_id", 3], ["topic", "Testing"], ["created_at", "2020-12-04 17:24:18.588865"], ["updated_at", "2020-12-04 17:24:18.588865"]]

  def destroy
    @presentation.destroy
---
DELETE FROM "presentations" WHERE "presentations"."id" = ?  [["id", 2]]

    def set_presentation
      @presentation = Presentation.find(params[:id])
---
SELECT "presentations".* FROM "presentations" WHERE "presentations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]