app/controllers/rates_controller.rb

  def index
    @rates = Rate.all
---
SELECT "rates".* FROM "rates"

  def create
    @rate = Rate.new(rate_params)

    respond_to do |format|
      if @rate.save
---
INSERT INTO "rates" ("song", "created_at", "updated_at") VALUES (?, ?, ?)  [["song", "Willow"], ["created_at", "2020-12-11 15:58:52.746240"], ["updated_at", "2020-12-11 15:58:52.746240"]]

  def update
    respond_to do |format|
      if @rate.update(rate_params)
---
UPDATE "rates" SET "loves" = ?, "likes" = ?, "updated_at" = ? WHERE "rates"."id" = ?  [["loves", 0], ["likes", 0], ["updated_at", "2020-12-11 16:19:47.168953"], ["id", 1]]

    def set_rate
      @rate = Rate.find(params[:id])
---
SELECT "rates".* FROM "rates" WHERE "rates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]