app/controllers/users_controller.rb

SELECT "presentations".* FROM "presentations" WHERE "presentations"."group_id" = ?  [["group_id", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    if @user.group_id != nil
      @presentations = @user.group.presentations

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "isTeacher") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "paul@sivilotti"], ["updated_at", "2020-12-05 22:11:14.128798"], ["id", 11]]
---
  def update
    respond_to do |format|
      params[:user].delete(:password) if params[:user][:password].blank?
      if @user.update(user_params)